app/views/posts/index.html.erb

                <div class="col-sm-12">
                  <p class="post-title float-left"><%= User.find(post.user_id).username%></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]