app/views/posts/show.html.erb

        <div class="col-sm-12">
          <p class="post-title float-left"><%= User.find(@post.user_id).username%></p>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]