app/controllers/posts_controller.rb

  def yposts
    @direction=[
      'Animation',
      'Game Development',
      'Filmmaking',
      'Web Development',
      'Music',
      'Writing',
      'Drawing',
      'Graphic Design',
      '3D Modeling',
      'Programming',
      'Robotics',
      'Motion Graphics',
      'Photography',
      'New Media'
    ]
    @posts = User.find(current_user.id).posts
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]