app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 10], ["created_at", "2019-12-24 12:18:51.839666"], ["updated_at", "2019-12-24 12:18:51.839666"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category", "11"], ["updated_at", "2019-12-24 23:05:29.646113"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)