app/controllers/static_pages_controller.rb

  def home
     if user_signed_in?
    @user=User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]